solarBeamWithTreeschu1/0.orig/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{

   glass
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           qr;
        qr              qr;
        kappa           none;
		thicknessLayers (0.01);//list of thicknesses per layer [m]
		kappaLayers     (6.4);//list of thermal conductivites per layer [W/m/K]
		thermalInertia  true;
    }
		inlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	inlet;
		sampleRegion    air;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field           T;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform  300;		// place holder
		//inletValue      uniform  0;
		//Prt             0.85; 
    }
    outlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	outlet;
		sampleRegion    air;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field           T;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform  300;		// place holder
		//inletValue      uniform  0;
		//Prt             0.85; 
    }
    solid_to_air
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;//wall：Coupled指流体还是固体
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           qr;
        qr              qr;
        kappa           none;
		thicknessLayers (0.2);//list of thicknesses per layer [m]
		kappaLayers     (1.6);//list of thermal conductivites per layer [W/m/K]
		thermalInertia  true;
    }
    solid_to_floor
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           none;
        qr              qr;
        kappa           none;
    }
}


// ************************************************************************* //
