solarBeamWithTreeschu1/0.orig/solid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.1 0 0 );

boundaryField
{
    glass
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
		inlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	inlet;
		sampleRegion    air;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field           U;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform  (0 0 0);		// place holder
		//inletValue      uniform  0;
		//Prt             0.85; 
    }
    outlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	outlet;
		sampleRegion    air;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field           U;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform   (0 0 0);		// place holder
		//inletValue      uniform  0;
		//Prt             0.85; 
    }
   solid_to_floor
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    solid_to_air
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
}


// ************************************************************************* //
