solarBeamWithTreeschu1/constant/floor/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/floor/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    maxY
    {
        type            patch;
        nFaces          80;
        startFace       12640;
    }
    minX
    {
        type            patch;
        nFaces          80;
        startFace       12720;
    }
    maxX
    {
        type            patch;
        nFaces          80;
        startFace       12800;
    }
    minY
    {
        type            patch;
        nFaces          80;
        startFace       12880;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       12960;
    }
    floor_to_air
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          6300;
        startFace       19360;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_floor;
    }
    floor_to_solid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          100;
        startFace       25660;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_floor;
    }
)

// ************************************************************************* //
