solarBeamWithTreeschu1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            patch;
        nFaces          4800;
        startFace       1136000;
    }
    minX
    {
        type            patch;
        nFaces          4800;
        startFace       1140800;
    }
    maxX
    {
        type            patch;
        nFaces          4800;
        startFace       1145600;
    }
    minY
    {
        type            patch;
        nFaces          4800;
        startFace       1150400;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1155200;
    }
    maxZ
    {
        type            patch;
        nFaces          6400;
        startFace       1161600;
    }
)

// ************************************************************************* //
