solarBeamWithTreeschu1/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5
(
    solid_to_air
    {
        type            mappedWall;
        inGroups        2 ( wall mappedPatch );
        nFaces          319;
        startFace       2140;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_solid;
    }

    solid_to_floor
    {
        type            mappedWall;
        inGroups        2 ( wall mappedPatch );
        nFaces          100;
        startFace       2459;
        sampleMode      nearestPatchFace;
        sampleRegion    floor;
        samplePatch     floor_to_solid;
    }

    glass
    {
        type            mappedWall;
        inGroups        2 ( wall mappedPatch );
        nFaces          99;
        startFace       2559;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_solid;
    }

    inlet
    {
        type            patch;
        nFaces          1;
        startFace       2658;
    }

    outlet
    {
        type            patch;
        nFaces          1;
        startFace       2659;
    }

)


// ************************************************************************* //
