solarBeamWithTreeschu1/system/air/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    "(glass|inlet|outlet)"
    {
        type            mappedWall;
        inGroups        2(wall mappedPatch);
        sampleMode      nearestPatchFace;
		sampleRegion    air;
        samplePatch     air_to_solid;
    }
}


// ************************************************************************* //
