solarBeamWithTreeschu1/system/air/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {	
	name glass;
	patchInfo
	{
	type wall;
	}
	constructFrom set;
	set glass;
    }
	
	{	
	name inlet;
	patchInfo
	{
	type wall;
	}
	constructFrom set;
	set inlet;
    }
	
    {	
	name outlet;
	patchInfo
	{
	type wall;
	}
	constructFrom set;
	set outlet;
    }
);


// ************************************************************************* //
