solarBeamWithTreeschu1/system/solid/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    //glass
    {
        name    glass;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (15   15  9)(25  25  9);
    }


    //inlet
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (15   18  3)(15  19  4);
    }
	
	
    //outlet
    {
        name    outlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (20   20  9)(21  21  9);
    }
);

// ************************************************************************* //
